# SATExportOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
SATExportOptions Constructor
SATExportOptions Class See Also
---
Constructs a new instance of SATImportOptions with default values of all properties.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SATExportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SATExportOptions()
```

# See Also
SATExportOptions Class
SATExportOptions Overload
Autodesk.Revit.DB Namespace